* Timings
  |       | Scheduling works |
  |-------+------------------|
  | T1k   |         0.018119 |
  | T2k   |         0.018191 |
  | T4k   |         0.027442 |
  | T8k   |         0.048465 |
  | T16k  |         0.105867 |
  | T32k  |         0.193492 |
  | T64k  |         0.378044 |
  | T128k |          0.83494 |
* Efficiency
** Schedule first working
   | Number     | Mine | Reference |   Percent |
   |------------+------+-----------+-----------|
   | report1.i  |   41 |        25 |      64.0 |
   | report2.i  |   24 |        23 |       4.3 |
   | report3.i  |   27 |        26 |       3.8 |
   | report4.i  |   50 |        33 |      51.5 |
   | report5.i  |   87 |        25 |     248.0 |
   | report6.i  |  129 |        43 |     200.0 |
   | report7.i  |   87 |        36 |     141.7 |
   | report8.i  |   16 |        15 |       6.7 |
   | report9.i  |   45 |        26 |      73.1 |
   | report10.i |   81 |        40 |     102.5 |
   | report11.i |   81 |        30 |     170.0 |
   | report12.i |   30 |        21 |      42.9 |
   | report13.i |   31 |        25 |      24.0 |
   | report14.i |   23 |        19 |      21.1 |
   | report15.i |   67 |        23 |     191.3 |
   | report16.i |  103 |        57 |      80.7 |
   | report17.i |   32 |        21 |      52.4 |
   | report18.i |   36 |        22 |      63.6 |
   | report19.i |   45 |        42 |       7.1 |
   | report20.i |   69 |        22 |     213.6 |
   | report21.i |   78 |        72 |       8.3 |
   | report22.i |   56 |        52 |       7.7 |
   | report23.i |  100 |        69 |      44.9 |
   |------------+------+-----------+-----------|
   |            |      |           | 79.269565 |
   #+TBLFM: @25$4=vmean(@2$4..@24$4)
** Remove some edges from outputs to stores and loads to stores based on value 
   | Number     | Mine | Reference | Percent |  Previous |   Improve |
   |------------+------+-----------+---------+-----------+-----------|
   | report1.i  |   32 |        25 |    28.0 |      64.0 |      36.0 |
   | report2.i  |   24 |        23 |     4.3 |       4.3 |       0.0 |
   | report3.i  |   27 |        26 |     3.8 |       3.8 |       0.0 |
   | report4.i  |   43 |        33 |    30.3 |      51.5 |      21.2 |
   | report5.i  |   87 |        25 |   248.0 |     248.0 |       0.0 |
   | report6.i  |   98 |        43 |   127.9 |     200.0 |      72.1 |
   | report7.i  |   75 |        36 |   108.3 |     141.7 |      33.4 |
   | report8.i  |   16 |        15 |     6.7 |       6.7 |       0.0 |
   | report9.i  |   45 |        26 |    73.1 |      73.1 |       0.0 |
   | report10.i |   70 |        40 |    75.0 |     102.5 |      27.5 |
   | report11.i |   70 |        30 |   133.3 |     170.0 |      36.7 |
   | report12.i |   30 |        21 |    42.9 |      42.9 |       0.0 |
   | report13.i |   30 |        25 |    20.0 |      24.0 |       4.0 |
   | report14.i |   23 |        19 |    21.1 |      21.1 |       0.0 |
   | report15.i |   60 |        23 |   160.9 |     191.3 |      30.4 |
   | report16.i |   96 |        57 |    68.4 |      80.7 |      12.3 |
   | report17.i |   32 |        21 |    52.4 |      52.4 |       0.0 |
   | report18.i |   36 |        22 |    63.6 |      63.6 |       0.0 |
   | report19.i |   45 |        42 |     7.1 |       7.1 |       0.0 |
   | report20.i |   59 |        22 |   168.2 |     213.6 |      45.4 |
   | report21.i |   78 |        72 |     8.3 |       8.3 |       0.0 |
   | report22.i |   56 |        52 |     7.7 |       7.7 |       0.0 |
   | report23.i |  100 |        69 |    44.9 |      44.9 |       0.0 |
   |------------+------+-----------+---------+-----------+-----------|
   |            |      |           |    65.4 | 79.269565 | 13.869565 |
#+TBLFM: $4='(format "%.1f" (* 100 (/ (- $2 $3) (float $3))));N::@25$4..@25$6=vmean(@2..@24)::@2$6..@24$6='(format "%.1f" (- $5 $4));N
                  
